In [1]:
import pandas as pd

## 예제 1-7 브로드캐스팅과 벡터화 연산

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6], [7,8,9]], columns=list('abc'))

In [3]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
df + 3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [5]:
df1 = pd.DataFrame([[3,3,3], [3,3,3], [3,3,3]], columns=list('abc'))

In [6]:
df1

   a  b  c
0  3  3  3
1  3  3  3
2  3  3  3

In [7]:
df + 3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [8]:
df + df1

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12